import src.config as cfg
from src.generate import combine_measures

# lst = [['E', '̚', ' ', ' ', '1̂̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3', ' ', ' ', ' ', '3̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̊', ' ̅', '5̃̀', ' ̅', '3̂̀', ' ̅', '2̃̀', ' ', ' ', ' ', '3̂̀'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̃̅', ' ', ' ', ' ', '2̂̄', ' ̄', ' ̄', '5̂̅', ' ̅', '6̃̅'], ['3̂', ' ', ' ', ' ', '3̂̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̅', ' ̅', '5̃̅', ' ̅', '3̂̅', ' ̅', '2̃̅', ' ', ' ', ' ', '3̂'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['E', '̚', ' ', ' ', '2̂̀', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3', ' ', ' ', ' ', '3̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̊', ' ̅', '5̃̀', ' ̅', '3̂̀', ' ̅', '2̃̀', ' ', ' ', ' ', '3̂̀'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̃̅', ' ', ' ', ' ', '2̂̄', ' ̄', ' ̄', '5̂̅', ' ̅', '6̃̅'], ['3̂', ' ', ' ', ' ', '3̂̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̅', ' ̅', '5̃̅', ' ̅', '3̂̅', ' ̅', '2̃̅', ' ', ' ', ' ', '3̂'], ['2̂̀', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅']]

# walloc = [375, 240, 270, 315, 240, 270, 315, 375, 240, 270, 315, 240, 270, 315]
# bars = ['|', '|', '|', '|', '|', '|', '|', '|', '|', '|', '|', '|', '|', '|']
# print(combine_measures(lst, bars, walloc))

walloc = [345, 210, 240, 285, 210, 240, 285, 345, 210, 240, 285, 210, 240, 285]
fin = [['E', '̚', ' ', ' ', '1̂̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3', ' ', ' ', ' ', '3̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̊̅', ' ̅', '5̃̀̅', ' ̅', '3̂̀̅', ' ̅', '2̃̀̅', ' ', ' ', ' ', '3̂̀'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̃̅', ' ', ' ', ' ', '2̂̄', ' ̄', ' ̄', '5̂̅', ' ̅', '6̃̅'], ['3̂', ' ', ' ', ' ', '3̂̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̅', ' ̅', '5̃̅', ' ̅', '3̂̅', ' ̅', '2̃̅', ' ', ' ', ' ', '3̂'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['E', '̚', ' ', ' ', '2̂̀̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3', ' ', ' ', ' ', '3̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̊̅', ' ̅', '5̃̀̅', ' ̅', '3̂̀̅', ' ̅', '2̃̀̅', ' ', ' ', ' ', '3̂̀'], ['1̂̄', '.̄', ' ̄', ' ̄', '1̃̅', ' ', ' ', ' ', '2̂̄', ' ̄', ' ̄', '5̂̅', ' ̅', '6̃̅'], ['3̂', ' ', ' ', ' ', '3̂̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅'], ['3̂̅', ' ̅', '5̃̅', ' ̅', '3̂̅', ' ̅', '2̃̅', ' ', ' ', ' ', '3̂'], ['2̂̀̄', '.̄', ' ̄', ' ̄', '1̅', ' ', ' ', ' ', '2̄', ' ̄', ' ̄', '5̅', ' ̅', '6̅']]

from PIL import Image, ImageDraw, ImageFont
import os

paper = Image.new('RGB', cfg.paper_sizes['a4'], (255, 255, 255))
paper_editable = ImageDraw.Draw(paper)

NotoSerif_reg = ImageFont.truetype('assets/NotoSerifCJKsc-Regular.otf', 50)
NotoSerif_li = ImageFont.truetype('assets/NotoSerifCJKsc-Light.otf', 50)

notes = ImageFont.truetype('assets/jianpu2.otf', 55)
notes_small = ImageFont.truetype('assets/jianpu2_small.otf', 55)

curr_x = 50
y = 150
for i, m in enumerate(fin):
    measure = ''.join(m)
    paper_editable.text((curr_x, y), measure, fill=(0, 0, 0), font=notes)
    curr_x += walloc[i]
cwd = os.getcwd()
paper.save(os.path.join(cwd, 'output/tester_paper.png'), 'PNG')